//Напишите программу, которая на вход принимает натуральное число N,
// а на выходе показывает его цифры через запятую.

using System;
using Internal;

Console.WriteLine("Введите число");
int num = Convert.ToInt32(Console.ReadLine());

while ()
{
    
}



