// Задайте строку, содержащую латинские буквы в обоих регистрах.
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.

// Входная строка со смешанными буквами обоих регистров 
string input = "aBcD1ef!-";
 // Преобразование всех заглавных букв в строчные
 
 string result = input.ToLower();// Встроенный метод для перемены заглавных букв на строчные.
 // Вывод результата 
 Console.WriteLine(result); 
